export type TableLevel = {
  id: number;
  letters: string[];
  words: string[];
  bonusWords: string[];
};

export const tableLevels: TableLevel[] = [
  {
    id: 1,
    letters: ["د", "ا", "م", "ر"],
    words: ["ما", "دار", "مادر"],
    bonusWords: [
      "در",
      "مار",
      "رام",
      "دام",
      "مد",
      "راد",
      "را",
      "ماد",
      "ادم",
      "دما",
      "ردا",
      "ارم",
      "دم",
      "مراد",


    ],
  },

  {
    id: 2,
    letters: ["س", "ا", "ر", "ب"],
    words: ["سر", "بار", "ارس"],
    bonusWords: [
      "با",
      "بس",
      "سرب",
      "اسب",
      "سراب",
      "سار",
    
      "راس",
      "ابر",
      "رسا",
      "اب",
   
    ],
  },

  {
    id: 3,
    letters: ["ی", "ا", "ز", "ب"],
    words: ["باز", "بازی", "زیبا"],
    bonusWords: [
      "با",
      "بی",
      "از",
   
      
      "زیب",
      "یاب",
      "بای",
      "ابزی",
    ],
  },

  {
    id: 4,
    letters: ["ا", "ت", "ک", "ب"],
    words: ["کت", "تاب", "کتاب"],
    bonusWords: [
      "باک",
      "تب",
      "کاتب",
      "کتب",
      "بت",
      "کات",

      "تاک",
      "اب",
      "تک",


    ],
  },

  {
    id: 5,
    letters: ["ر", "و", "خ", "ش"],
    words: ["شوخ", "خوش", "خورش"],
    bonusWords: [
      "رود",
      "خور",
    
      "خو",
      "شور",
      "خروش",
      "روش",
      "رخ",
      "شر",
      "رخش",
    ],
  },

  {
    id: 6,
    letters: ["ک", "ر", "م", "ز", "ت"],
    words: ["کرم", "رمز", "تمرکز", "ترمز"],
    bonusWords: [
      "کم",
      "کر",
      "مرکز",
      "رک",
      "مرز",
      "ترک",
      "متر",
      "تمر",
      "رزم",
      "ترم",
      
    ],
  },

  {
    id: 7,
    letters: ["ن", "ا", "د", "ش"],
    words: ["شاد", "شنا", "ندا", "دانش"],
    bonusWords: [
      "دنا",
     
      "شن",
      "نشا",
      "شان",
      "دانا",
    

    ],
  },

  {
    id: 8,
    letters: ["ف", "ک", "ر", "ت", "س"],
    words: ["تفکر", "فکر", "ترس", "کرفس"],
    bonusWords: [
      "سفر",
      "رفت",
      "سفت",
      "کف",
      "فک",
      "سر",
      "ترک",
      "شر",
      "کفر",
      "سرک",
      "کسر",
    ],
  },

  {
    id: 9,
    letters: ["پ", "ی", "ا", "م", "ن"],
    words: ["امن", "میان", "پیام", "پیمان"],
    bonusWords: [
      "نیا",
      "پین",
      "ما",
      "نام",
      "ایمن",
      
      "نامی",
      "یمن",
      "نیم",
      "امین",
      "مینا",
      "مانی",
      "نیما",
      "نما",
      "نای",

    ],
  },

  {
    id: 10,
    letters: ["گ", "ه", "م", "ا", "ن"],
    words: ["نگاه", "نامه", "گام", "گناه"],
    bonusWords: [
      "هاگ",
      "نگه",
      "امن",
      "گمان",
      "هنگام",
      "هما",
      "همان",

      "منها",

     
      "هان",


    ],
  },

  {
    id: 11,
    letters: ["ب", "ه", "ا", "ر", "ن"],
    words: ["بهار", "بره", "برهان", "بنا"],
    bonusWords: [
      "اره",
      "هار",
      "ران",
      "بار",
      "نار",
      "هنر",
      "اهر",
      "رب",
      "ابر",
      "بهران",
      "رهن",
      "ابهر",
      "نهر",
      "بنر",
      "انبه",
      "راه",
      "ناب",
      "بانه",
      "انبر",
      "رها",
      "باهنر",
     

    ],
  },

  {
    id: 12,
    letters: ["خ", "ا", "ن", "ه", "و"],
    words: ["خانه", "اهن", "خون", "نوا"],
    bonusWords: [
      "هوا",
      "خان",
      "نه",
      "وان",
      "اهو",
      "نوه",
      "ناو",
      "نخ",



    ],
  },

  {
    id: 13,
    letters: ["ک", "ا", "ر", "م", "ی"],
    words: ["کار", "کریم", "مکار", "مری"],
    bonusWords: [
      "کاری",
      "رام",
      "کام",
      "کرم",
    
      "ارم",
      "یار",
      "رای",
      "ریکا",
      "اکرم",
      "امیر",
      "امر",
      "کمر",
      "کما",
      "مکار",
     

    ],
  },

  {
    id: 14,
    letters: ["س", "ا", "ل", "م", "ی"],
    words: ["سال", "سیما", "سالم", "سلام"],
    bonusWords: [

      "ملس",
      "سم",
      "مس",
     
      "سلیم",
      "لمس",
      "یال",
      "لیس",
      "میل",
      "ملی",
      "مال",
      "مالی",
      "سیم",
    
      "سام",
      "سیل",
      "اسم",
      "مایل",
      "سمی",
      "سیال",

    ],
  },

  {
    id: 15,
    letters: ["ن", "ا", "ر", "ا", "ب"],
    words: ["باران", "ناب", "برنا", "انار", "بنا"],
    bonusWords: [
      "با",
      "بر",
      "نا",
      "نار",
      "ران",
      "ابر",
      "آن",
      "را",
      "بار",
      "رانا",
      "ربا",
      
    ],
  },

  {
    id: 16,
    letters: ["د", "ا", "ر", "ی", "ا"],
    words: ["دریا", "دیار", "ایراد", "اداری", "یاد"],
    bonusWords: [
      "ارادی",
      "رای",
      "یار",
      "دار",
      "آری",
      "راد",
      
      "دایر",
      "دارا",
      
      "دیر",
      "ردا",
     
    ],
  },
  {
    id: 17,

    letters: ["ن", "ک", "د", "ر", "ا", "م"],

    words: [
      "کارمند",
      "درمان",
      "اردک",
      "کرمان",
      "مدار",
      "کادر",

    ],

    bonusWords: [
   
      "کمان",
      "دکان",
      "نمک",
      "نام",
      "دام",
      "مار",
      "کار",
      "کمد",
    
      "مرد",
      "مکان",
      "نادم",
      "درام",
      "نرم",
      "درک",
      
      "کارد",
      "رمان",
      "دامن",
      "مکار",
      "نمد",
    
      "کنار",
      "اکرم",
      "کندر",
      "رامک",
      "دمار",
      "نماد",
      "درنا",
      "مادر",
      "رکن",
      "کدام",
      "کام",
      "کدر",
      "ماد",
      "دما",
      "رام",
      "دامن",
      "مارک",
      "کمند",
      "مکر",
      "کند",
      "مراد",
      "مکدر",
      "نامرد",
      "مدرک",
      "مردک",
      "مدارک",
      "نمدار",
      
    ],
  },

  {
    id: 18,

    letters: ["م", "م", "ا", "ر", "ن", "ی"],

    words: [
      "رمان",
      "نام",
      "مینا",
      "ایمن",
      "مرام",
      "مریم",

    ],

    bonusWords: [
      "نیم",
      "یار",
      "رام",
      "نای",
      "مار",
      "نیما",
      "امن",
      "مانی",
      "امیر",
    
      "امین",
      "منیر",
      "ارمین",
      "ریما",
      "نامی",
      "نما",
      "رامین",
  
      "مین",
      


    ],
  },
  {
    id: 19,

    letters: ["ت", "د", "ی", "ر", "ی", "م"],

    words: [
      "مدیریت",
      "مدیر",
      "مرید",
      "تیر",
      "دیر",
    ],

    bonusWords: [
      "مرد",

      "دیم",
      "ریتم",
      "میت",
      "مرتد",
      "مدت",
      "ترد",
      "ترم",
      "مرتد",
      "تیم",
    ],
  },
  {
    id: 20,

    letters: ["ت", "ر", "ر", "پ", "ا", "س"],

    words: [
      "پرستار",
      "پارس",
      "سپر",
      "پارت",
      "تار",
    ],

    bonusWords: [
      "پرس",
      "رسا",
      "راست",
      "است",
      "پرت",
      "تراس",
      "پاس",
      "تاس",
   
      "راس",
      "ستار",
      "پسر",
      "ارس",
      "راس",
      "تاس",
      "پست",
      
    

    ],
  },
  {
    id: 21,
    letters: ["ن", "ه", "ا", "ر", "م"],
    words: [
      "مهر",
      "راه",
      "نهر",
      "رمان",
      "مهران",
    ],
    bonusWords: [
      "من",
      "رها",
      "نه",
    
      "را",
      "رام",
      "نار",
      "مار",
      "اهن",
      "هرم",
      "نما",
      "ماه",
      "مناره",
      "رهام",
      "ماهر",
      "مهار",
      "هار",
      "ارم",
      "نامه",
      "اهرم",
      "هما",
      "رهن",
      "نمره",
    ],
  },
  {
    id: 22,

    letters: ["ت", "ق", "ا", "م", "و", "م"],

    words: [
      "قوم",
      "قامت",
      "ماموت",
      "ماتم",
      "مقاومت",
    ],

    bonusWords: [

      "مو",
      "قم",
      "وام",
      "موم",
      "مقام",
      "قوام",
      "تمام",
      "مقاوم",
      "مات",
      "موقت",
    
      "تقوا",
     
      "مقوا",
      "وات",
      "وقت",
      "قوت",
      "امت",
      "اتم",
    ],
  },
  {
    id: 23,

    letters: ["ع", "ج", "ا", "م", "ل", "ا"],

    words: [
      "عاج",
      "عامل",
      "مجال",
      "اعلام",
      "معالج",
    ],

    bonusWords: [
      "جام",
      "مال",
     
   
    
      "عمل",
    
      "عالم",
      "جمال",
     
     
    
     
      "جلا",
      "جمع",
      "علم",
     
      "اجمال",
      "اجل",
      "اجمال",
      "علاج",
      "جلا",
      "علم",
      "عام",
      "اعمال",
      "ملاج",
      "املا",
      "جمع",
      "جعل",
      "اما",
    ],
  },
  {
    id: 24,

    letters: ["ع", "ب", "ق", "ا", "ر", "ت"],

    words: [
      "برق",
      "عبرت",
      "عابر",
      "براق",
      "عبارت",
    ],

    bonusWords: [
      "عرق",

      "ربع",
 
      "بار",
      "تاب",
      "تار",
      "بقا",
      "قبا",
      "قبر",
      "عرب",
      "برات",
      "عبا",
      "قاب",
      "ترب",
      "عقاب",
      "عقرب",
      "عقب",
      "رقابت",
      "باقر",
      "عاقبت",
      "تبار",
     
    ],
  },

  {
    id: 25,

    letters: ["گ", "و", "ا", "ر", "س", "ی"],

    words: [
     
      "سیگار",
      "گیس",
      "سوار",
      "سیر",
      "یاس",
    ],

    bonusWords: [
      "گور",
      "گوی",
      "سار",
      "سور",
      "ریگ",
      "ساری",
      "سایر",
      "گیرا",
      "سواری",
   
     
      "رسا",
      "سیار",
     
      "راسو",
      "گاو",
      "سوگ",
      "سوا",
      
      "گیسو",
      "گاری",
      "رسوا",
      "گرا",
      
      "یوگا",
      "اسیر",
      "سوری",
      "یاور",
      "ویار",
      "واریس",
      "اسیر",
      "راوی",

    ],
  },

  {
    id: 26,
    letters: ["ف", "ر", "ه", "ن", "گ", "ا"],
    words: [
      "فرهنگ",
      "اهنگ",
      "نگار",
      "رفاه",
      "فرنگ",
    ],
    bonusWords: [
      "رنگ",
      "گران",
      "فنر",
      "رها",
      "گره",
      "گهر",
      "نگر",
      "فرا",
   
      "نهر",
      "فن",
      "رگ",
      "گرا",
      "فان",
      "هنر",
      "اهن",
      "گناه",
      "هاگ",
      "نفر",
      "نگاه",
      
      "انگ",
    ],
  },

  {
    id: 27,
    letters: ["د", "ر", "و", "د", "س", "ت"],
    words: [
      "دوردست",
      "درست",
      "دوست",
      "دود",
      "ترد",
    ],
    bonusWords: [
      "دور",
      "رود",
      "تور",
      "سود",
      "سوت",
      "سور",
      "دست",
      "سرد",
      "درس",
      "رد",
      "دو",
      "تو",
      "در",
      "درد",
      
      "ترس",
      "سرود",
      "درود",
    ],
  },
  {
    id: 28,
    letters: ["ب", "ا", "د", "ن", "ه", "ر"],
    words: [
      "بند",
      "دهان",
      "نادر",
      "بندر",
      "برنده",
    ],
    bonusWords: [
      "بدن",
      "درب",
      "دانه",
      "رها",
      "باده",
   
      "هدر",
      "رند",
      "راه",
   
      "بانه",
      "ندا",
      "باند",
      "برد",
      "بهدار",
      "برهان",
      "بهار",
      "بهران",
      "بهادر",
      "دبه",
      "دربان",
      "رنده",
      "ناب",
      "ارده",
      "هند",
      "ادب",
      "نرده",
      "برنا",
      "براده",
      "دره",
      "درنا",
      "نبرد",
    ],
  },
  {
    id: 29, letters: ["ک", "و", "ه", "ا", "ر", "ن"],
     words: ["کوه", "کهن", "کارون", "روان", "کوهان",],
    bonusWords: [
      "کاه",
      "هور",
      "رکن",
      "کوره",
      "کاور",
      "کرانه",
      "کنار",
    
      "راکن",
      "هوا",
      "کناره",
      "کاهن",
      "کاوه",
      
      "کره",
      "کور",
      "نوار",
      "نور",
      "رهن",
      "اهو",
     
    ],
  },
  {
  id: 30,

  letters: ["ه", "ر", "ب", "ط", "ض", "ا"],

  words: [
    "ضرب",
    "ربط",
    "ضربه",
    "رباط",
    "رطب",
 
  ],

  bonusWords: [
  
    "راه",
    "رها",
    "ره",
    "بار",
 
    "رب",
    "ضابط",
    "طب",
    "ضابطه",
    "رابط",
    "رابطه",
    "بها",
    "رضا",
    "ضبط",
  
    
  ],
},

{
  id: 31,

  letters: ["ث", "ا", "ب", "ت", "ر", "ی"],

  words: [
    "تبر",
    "بیت",
    "تبار",
    "ثابت",
    "ثریا",
  ],

  bonusWords: [
    
   
    "تب",
    "تاب",
    "بار",
    "یار",
    "رای",
  
    "باری",
    "بیتا",
    "تیر",
    "ربات",
    "برات",
    "ثبات",
    "تایر",
    "بایر",
    "ارث",
    "ثبت",
    "بیات",
    "ابی",
   
  ],
},

{
  id: 32,

  letters: ["ژ", "ا", "ل", "ه", "ی", "ن"],

  words: [
    "ژاله",
    "ناله",
    "لایه",
    "نهال",
    "لانه",
  ],

  bonusWords: [
    "یال",
    "ژل",
    "ژله",
    "هال",
    "یل",
    "ژینا",
 
   
    "نی",
   
    "هل",
    "هلیا",
    "ژیلا",
    "نیل",
    "ژیان",
   
   
    
  ],
},
{
  id: 33,

  letters: ["ن", "ر", "و", "ه", "پ", "ا"],

  words: [
    "پروانه",
    "پناه",
    "پونه",
    "نوار",
    "پروا",
    "روا",
  ],

  bonusWords: [
    "پاره",
    
    "پوره",
    "پارو",
  
   
    "پرو",
 
  
    "راه",
    "رهن",
    "نار",
    "نور",
    "وان",
 
    "نوه",
   
   
    "روان",
    "روانه",
    "پهن",
    "ران",
  
    
  ],
},
{
  id: 34,

  letters: ["ن", "ا", "ش", "ی", "م", "ه"],

  words: [
    "ماشین",
    "میانه",
    "شانه",
    "ماشه",
    "میش",
    "میهن",
  ],

  bonusWords: [
    
    "میان",
    "مینا",
    "امین",
    "نیش",
    "نیام",
    "نامی",
   
    "نای",
  
   
    "ماه",
    "هما",
    "شاهین",
    "شهین",
    "هاشم",
    "شیما",
    "ماهی",
    "مهین",
    "شام",
    "نمایش",
    "همایش",
    "ناشی",
    "یشم",
    "نمایه",
    "نیمه",
    "مایه",
  ],
},
{
  id: 35,

  letters: ["ج", "و", "ه", "ر", "ی", "م"],

  words: [
    "جمهوری",
    "جریمه",
    "مهر",
    "جیوه",
    "موج",
    "میوه",
  ],

  bonusWords: [
  
 
   

    "روی",
  
   
  
   
    "جوهر",
    "جمهور",
   
    
    "جهرم",
    "هجر",
    "جرم",
    "جیر",
    "جیره",
    "جور",
    "جوی",
    "هویج",
    "",
    "مهرجو",
   
  ],
},
{
  id: 36,
  letters: ["ک", "ش", "ی", "د", "ا", "ن"],
  words: [
    "کشیدن",
    "ناشی",
    "شاید",
    "دنیا",
    "نیک",
  ],
  bonusWords: [
    "کاشی",
    "شیک",
    "کاش",
    "دان",
    "شدن",
    "شادی",
    
    "نشد",
  ],
},

{
  id: 37,
  letters: ["پ", "ی", "ش", "ر", "ف", "ت"],
  words: [
    "پیشرفت",
    "شریف",
    "تپش",
    "پشت",
    "شرف",
  ],
  bonusWords: [
    "فیش",
    "پیر",
    "پری",
    "فرش",
    "شیر",
    "ترش",
    "ریش",
    "تشر",
  ],
},

{
  id: 38,
  letters: ["ا", "ن", "د", "ی", "ش", "ه"],
  words: [
    "اندیشه",
    "شیدا",
    "نهاد",
    "هندی",
    "نهی",
  ],
  bonusWords: [
    "دین",
    "دانی",
    "این",
    "نهد",
    "انده",
    "دیه",
    "دهن",
    "دیش",
  ],
},

{
  id: 39,
  letters: ["و", "ر", "ز", "ش", "ی", "ا"],
  words: [
    "ورزشی",
    "ریزش",
    "زیور",
    "رویش",
    "یورش",
  ],
  bonusWords: [
    "ورزش",
    "وزیر",
    "زیر",
    "ریز",
    "زری",
    "زوار",
    "روزی",
    "یوز",
  ],
},

{
  id: 40,
  letters: ["ا", "ن", "ن", "گ", "ی", "ز", "ه"],
  words: [
    "انگیزه",
    "نگین",
    "گزینه",
    "نیزه",
    "زنگ",
  ],
  bonusWords: [
    "گزین",
    "زین",
    "نیز",
    "گنه",
    "هیز",
    "ننگ",
    "انگیز",
  ],
},














];

export function getTableLevel(
  levelId: number
): TableLevel | undefined {
  return tableLevels.find(
    (level) => level.id === levelId
  );
}

export function normalizeWord(
  word: string
): string {
  return word
    .trim()
    .replace(/ي/g, "ی")
    .replace(/ى/g, "ی")
    .replace(/ك/g, "ک")
    .replace(/\u200c/g, "");
}

export function checkTableWord(
  levelId: number,
  word: string
): boolean {
  const level = getTableLevel(levelId);

  if (!level) {
    return false;
  }

  const normalizedWord = normalizeWord(word);

  return level.words.some(
    (item) =>
      normalizeWord(item) === normalizedWord
  );
}

export function isBonusWord(
  levelId: number,
  word: string
): boolean {
  const level = getTableLevel(levelId);

  if (!level) {
    return false;
  }

  const normalizedWord = normalizeWord(word);

  // فقط کلمات اصلی همین مرحله را بررسی می‌کنیم
  const isMainWord = level.words.some(
    (mainWord) =>
      normalizeWord(mainWord) === normalizedWord
  );

  if (isMainWord) {
    return false;
  }

  // فقط بونوس‌های همین مرحله
  return level.bonusWords.some(
    (bonusWord) =>
      normalizeWord(bonusWord) === normalizedWord
  );
}