export type TableLevel = {
  id: number;
  letters: string[];
  words: string[];
  bonusWords: string[];
};

export const tableLevels: TableLevel[] = [
  {
    id: 1,
    letters: ["م", "ا", "د", "ر"],
    words: ["ما", "دار", "مادر"],
    bonusWords: [
      "در",
      "مار",
      "رام",
      "دام",
      "مد",
      "راد",
      "را",
      "ماد",
      "ادم",
      "دما",
      "ردا",
      "ارم",
      "دم",


    ],
  },

  {
    id: 2,
    letters: ["س", "ا", "ر", "ب"],
    words: ["سر", "بار", "ارس"],
    bonusWords: [
      "با",
      "بس",
      "سرب",
      "اسب",
      "سراب",
      "سار",
      "بارس",
      "راس",
      "ابر",
      "رسا",
      "اب",
   
    ],
  },

  {
    id: 3,
    letters: ["ی", "ا", "ز", "ب"],
    words: ["باز", "بازی", "زیبا"],
    bonusWords: [
      "با",
      "بی",
      "از",
      "ای",
      "زی",
      "زیب",
      "یاب",
      "بای",
      "ابزی",
    ],
  },

  {
    id: 4,
    letters: ["ا", "ت", "ک", "ب"],
    words: ["کت", "تاب", "کتاب"],
    bonusWords: [
      "باک",
      "تب",
      "کاتب",
      "کتب",
      "بت",
      "کات",

      "تاک",
      "اب",
      "تک",


    ],
  },

  {
    id: 5,
    letters: ["ر", "و", "خ", "ش"],
    words: ["خور", "خوش", "خورش"],
    bonusWords: [
      "رود",
      "ور",
      "خو",
      "شور",
      "خروش",
      "روش",
      "رخ",
      "شر",
      "رخش",
    ],
  },

  {
    id: 6,
    letters: ["ک", "ر", "م", "ز", "ت"],
    words: ["کرم", "رمز", "تمرکز", "ترمز"],
    bonusWords: [
      "کم",
      "کر",
      "مرکز",
      "رک",
      "مرز",
      "ترک",
      "متر",
      "تمر",
      "رزم",
    ],
  },

  {
    id: 7,
    letters: ["ن", "ا", "د", "ش"],
    words: ["شاد", "شنا", "ندا", "دانش"],
    bonusWords: [
      "دنا",
      "ان",
      "شن",
      "نشا",
      "شان",
      "دانا",
      "ناد",

    ],
  },

  {
    id: 8,
    letters: ["ف", "ک", "ر", "ت", "س"],
    words: ["تفکر", "فکر", "ترس", "کرفس"],
    bonusWords: [
      "سفر",
      "رفت",
      "سفت",
      "کف",
      "فک",
      "سر",
      "ترک",
      "شر",
      "کفر",
    ],
  },

  {
    id: 9,
    letters: ["پ", "ی", "ا", "م", "ن"],
    words: ["امن", "میان", "پیام", "پیمان"],
    bonusWords: [
      "نیا",
      "پین",
      "ما",
      "ایمن",
      "نام",
      "ایمن",
      "پام",
      "نامی",
      "یمن",

    ],
  },

  {
    id: 10,
    letters: ["گ", "ه", "م", "ا", "ن"],
    words: ["نگاه", "نامه", "گام", "گناه"],
    bonusWords: [
      "هاگ",
      "نگه",
      "امن",
      "گمان",
      "هنگام",
      "هما",
      "همان",

      "منها",

      "گام",
      "هان",


    ],
  },

  {
    id: 11,
    letters: ["ب", "ه", "ا", "ر", "ن"],
    words: ["بهار", "بره", "برهان", "بنا"],
    bonusWords: [
      "اره",
      "هار",
      "ران",
      "بار",
      "نار",
      "هنر",
      "اهر",
      "رب",
      "ابر",
      "بهران",
      "رهن",
      "ابهر",
      "نهر",

    ],
  },

  {
    id: 12,
    letters: ["خ", "ا", "ن", "ه", "و"],
    words: ["خانه", "اهن", "خون", "نوا"],
    bonusWords: [
      "هوا",
      "خان",
      "نه",
      "وان",
      "اهو",
      "نوه",
      "ناو",



    ],
  },

  {
    id: 13,
    letters: ["ک", "ا", "ر", "م", "ی"],
    words: ["کار", "کریم", "مکار", "مری"],
    bonusWords: [
      "کاری",
      "رام",
      "کام",
      "کرم",
      "مکار",
      "ارم",
      "یار",
      "رای",
      "ریکا",
      "اکرم",
      "امیر",
      "امر",
      "کاری",

    ],
  },

  {
    id: 14,
    letters: ["س", "ا", "ل", "م", "ی"],
    words: ["سال", "مال", "سالم", "سلام"],
    bonusWords: [

      "ملس",
      "سم",
      "مس",
      "لام",
      "سلیم",
      "لمس",
      "یال",
      "لیس",
      "میل",
      "ملی",
      "مال",
      "مالی",
      "سیم",
      "سیما",
      "سام",
      "سیل",

    ],
  },

  {
    id: 15,
    letters: ["ن", "ا", "ر", "ا", "ب"],
    words: ["باران", "ناب", "برنا", "انار", "بنا"],
    bonusWords: [
      "با",
      "بر",
      "نا",
      "نار",
      "ران",
      "ابر",
      "آن",
      "را",
      "بار",
      "رانا",
      "ربا",
      
    ],
  },

  {
    id: 16,
    letters: ["د", "ا", "ر", "ی", "ا"],
    words: ["دریا", "دیار", "ایراد", "اداری", "یاد"],
    bonusWords: [
      "ارادی",
      "رای",
      "یار",
      "دار",
      "آری",
      "راد",
      "داری",
      "دایر",
      "دارا",
      "ایراد",
      "ردا",
    ],
  },
  {
    id: 17,

    letters: ["ن", "ک", "د", "ر", "ا", "م"],

    words: [
      "کارمند",
      "درمان",
      "اردک",
      "کرمان",
      "مدار",
      "کادر",

    ],

    bonusWords: [
   
      "کمان",
      "دکان",
      "نمک",
      "نام",
      "دام",
      "مار",
      "کار",
      "کمد",
      "مادر",
      "مرد",
      "مکان",
      "نادم",
      "درام",
      "نرم",
      "درک",
      "مکار",
      "کارد",
      "رمان",
      "مادر",
      "کنار",
      "اکرم",
      "کندر",
      "رامک",
      "دمار",
    ],
  },

  {
    id: 18,

    letters: ["م", "م", "ا", "ر", "ن", "ی"],

    words: [
      "رمان",
      "نام",
      "مینا",
      "ایمن",
      "مرام",
      "مریم",

    ],

    bonusWords: [
      "نیم",
      "یار",
      "رام",
      "نای",
      "مار",
      "نیما",
      "امن",
      "مانی",
      "امیر",
      


    ],
  },
  {
    id: 19,

    letters: ["ت", "د", "ی", "ر", "ی", "م"],

    words: [
      "مدیریت",
      "مدیر",
      "مرید",
      "تیر",
      "دیر",
    ],

    bonusWords: [
      "مرد",
      "دری",
      "دیم",
      "ریتم",
      "میت",
    ],
  },
  {
    id: 20,

    letters: ["ت", "ر", "ر", "پ", "ا", "س"],

    words: [
      "پرستار",
      "پارس",
      "سپر",
      "پارت",
      "تار",
    ],

    bonusWords: [
      "پرس",
      "رسا",
      "راست",
      "است",
      "پرت",
      "تراس",
      "پاس",

    ],
  },
  {
    id: 21,
    letters: ["ن", "ه", "ا", "ر", "م"],
    words: [
      "مهر",
      "راه",
      "نهر",
      "رمان",
      "مهران",
    ],
    bonusWords: [
      "من",
      "رها",
      "نه",
      "هر",
      "را",
      "رام",
      "نار",
      "مار",
      "اهن",
      "هرم",
      "نما",
      "ماه",
      "مناره",
      "رهام",
      "ماهر",
      "مهار",
      "هار",
      "ارم",
      "نامه",
      "اهرم",
    ],
  },
  {
    id: 22,

    letters: ["ت", "ق", "ا", "م", "و", "م"],

    words: [
      "قوم",
      "قامت",
      "ماموت",
      "ماتم",
      "مقاومت",
    ],

    bonusWords: [

      "مو",
      "قم",
      "وام",
      "موم",
      "مقام",
      "قوام",
      "تمام",
      "مقاوم",
      "مات",
      "موقت",
      "اموت",
      "تقوا",
      "تام",
      "مقوا",
      "وات",
    ],
  },
  {
    id: 23,

    letters: ["ع", "ج", "ا", "م", "ل", "ا"],

    words: [
      "عاج",
      "عامل",
      "مجال",
      "اعلام",
      "معالج",
    ],

    bonusWords: [
      "جام",
      "مال",
      "حال",
      "لام",
      "علا",
      "عمل",
      "عامل",
      "عالم",
      "جمال",
      "مجال",
      "علام",
      "اعلام",
      "عجله",
      "مجله",
      "معالج",
      "اجمال",
    ],
  },
  {
    id: 24,

    letters: ["ع", "ب", "ق", "ا", "ر", "ت"],

    words: [
      "برق",
      "عبرت",
      "عابر",
      "ربع",
      "عبارت",
    ],

    bonusWords: [
      "عرق",
      "عاق",
      "ربع",
      "رباع",
      "بار",
      "تاب",
      "تار",
      "باق",
      "قار",
      "عبر",
      "عرب",
      "برات",
      "عبا",
      "قاب",
      "براق",
    ],
  },

  {
    id: 25,

    letters: ["گ", "و", "ا", "ر", "س", "ی"],

    words: [
     
      "سوری",
      "گیرا",
      "سوار",
      "سیر",
      "یاس",
    ],

    bonusWords: [
      "گور",
      "گوی",
      "سار",
      "سور",
      "ریگ",
      "ساری",
      "سایر",
      "گیس",
      "گیسو",
      "یوگا",
      "رسا",
      "سیار",
      "وارسی",
      "راسو",
      
      "گیسو",
      "گاری",
      "رسوا",
      "گرا",
      "گیرا",
      "یوگا",

    ],
  },

  {
    id: 26,
    letters: ["ف", "ر", "ه", "ن", "گ", "ا"],
    words: [
      "فرهنگ",
      "اهنگ",
      "نگار",
      "گناه",
      "فرنگ",
    ],
    bonusWords: [
      "رنگ",
      "گران",
      "فنر",
      "رها",
      "گره",
      "گهر",
      "نگر",
      "فرا",
      "رفاه",
      "نهر",
      "فن",
      "رگ",
      "گرا",
      "فان",
      "هنر",
      
      "انگ",
    ],
  },

  {
    id: 27,
    letters: ["د", "ر", "و", "د", "س", "ت"],
    words: [
      "دوردست",
      "درست",
      "دوست",
      "دود",
      "ترد",
    ],
    bonusWords: [
      "دور",
      "رود",
      "تور",
      "سود",
      "سوت",
      "سور",
      "دست",
      "سرد",
      "درس",
      "رد",
      "دو",
      "تو",
      "در",
      "درد",
      "ستر",
      "ترس",
    ],
  },
  {
    id: 28,
    letters: ["ب", "ا", "د", "ن", "ه", "ر"],
    words: [
      "بند",
      "دهان",
      "نادر",
      "بندر",
      "برنده",
    ],
    bonusWords: [
      "بدن",
      "درب",
      "دانه",
      "رها",
      "باده",
      "نرد",
      "هدر",
      "رند",
      "راه",
      "به",
      "بانه",
      "ندا",
      "باند",
      "برد",
    ],
  },
  {
    id: 29, letters: ["ک", "و", "ه", "ا", "ر", "ن"],
     words: ["کوه", "کهن", "کارون", "روان", "کوهان",],
    bonusWords: [
      "کاه",
      "هور",
      "رکن",
      "کوره",
      "کانه",
      "کرانه",
      "کنار",
      "کور",
      "راکن",
      "هوا",
      "کناره",
      "کاهن",
      "کوهان",
    ],
  },
  {
  id: 30,

  letters: ["ه", "ر", "ب", "ط", "ض", "ا"],

  words: [
    "ضرب",
    "ربط",
    "ضربه",
    "رباط",
    "ضابطه",
 
  ],

  bonusWords: [
    "به",
    "راه",
    "رها",
    "ره",
    "بار",
    "تاب",
    "رب",
    "ضابط",
    "طب",
    "رطب",
    
  ],
},










];

export function getTableLevel(
  levelId: number
): TableLevel | undefined {
  return tableLevels.find(
    (level) => level.id === levelId
  );
}

export function normalizeWord(
  word: string
): string {
  return word
    .trim()
    .replace(/ي/g, "ی")
    .replace(/ى/g, "ی")
    .replace(/ك/g, "ک")
    .replace(/\u200c/g, "");
}

export function checkTableWord(
  levelId: number,
  word: string
): boolean {
  const level = getTableLevel(levelId);

  if (!level) {
    return false;
  }

  const normalizedWord = normalizeWord(word);

  return level.words.some(
    (item) =>
      normalizeWord(item) === normalizedWord
  );
}

export function isBonusWord(
  levelId: number,
  word: string
): boolean {
  const level = getTableLevel(levelId);

  if (!level) {
    return false;
  }

  const normalizedWord = normalizeWord(word);

  // کلمه‌ای که در هر مرحله‌ای کلمه اصلی است،
  // هیچ‌وقت نباید به عنوان کلمه جایزه ثبت شود.
  const isMainWord = tableLevels.some(
    (item) =>
      item.words.some(
        (mainWord) =>
          normalizeWord(mainWord) ===
          normalizedWord
      )
  );

  if (isMainWord) {
    return false;
  }

  return level.bonusWords.some(
    (bonusWord) =>
      normalizeWord(bonusWord) ===
      normalizedWord
  );
}